<?php

use Illuminate\Database\Seeder;

class ArticlesTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $titles = [
            '「我心中最赞的歌手」短暂的岁月永放光辉',
            '咪蒙开课：全民作写，人人开课——求求你放过粉丝们吧',
            '旅行四年，我告诉你中国必去的十个地方——和顺古镇',
            '这本看到书名就让人昏昏欲睡的书，为什么值得一读？',
            '塔西佗陷阱？塔西佗并没有挖过陷阱，但他留下了一个诅咒。',
        ];

        $content = '我对腾冲一点都不陌生，尤其是和顺古镇。但我只去过哪里一次。

然而第一次却没有陌生感，只有一种隐隐约约再相见时的感觉。


哦，可能你还不知道腾冲在哪儿，更不要说和顺了。或者很大一部分人呢，知道和顺古镇，却不知道腾冲。

和顺古镇在云南保山的腾冲，是作为腾冲旅游文化的名片被推广，是著名的侨乡，曾经入围全国十大魅力名镇并荣获唯一的年度大奖，有文化艺术价值的古民居建筑，也蕴育了中国现代伟大的马克思主义哲学家艾思奇。

其实，我个人是不太喜欢把一个地方的历史扒出来复制粘贴上一大段，感觉自己很懂一样。我更喜欢说自己在路上的经历，因为那些东西一直都在，而我的经历是独一无二的。而且我已经点到了这里，如果有兴趣可以自己去查阅资料。


我第一次听说腾冲，是因为读大学的时候班里有个关系还不错的同学家就在这里。那时候，每次和他去食堂吃饭，他都要把想念腾冲铒块挂在嘴边，耳濡目染我也就向往这里。

后来在网上看到腾冲的银杏村，我的内心一阵沸腾，按耐不住的想要去这里拍下令自己感动的瞬间。

我一直相信，有些地方，即使你没有去过，只要隐约听到或者看到，就也会像磁铁一样吸引着你，就好像你一直向往大理洱海，向往西藏纳木错一样，那么腾冲对我而言，大概就是这样的地方。

所以，很多人问我云南有什么好玩的地方，除了大理丽江香格里拉广为人知的地方，我还会说要是时间足够，去腾冲走走吧，或者西双版纳普者黑，又或者红河哈尼梯田……




其实，我之前是没有特意计划过要去腾冲旅行的，当时是参加了一个环驾项目，有幸偶遇，然后到了这里。

G320（国道）从上海一直修到了瑞丽，我们从南京出发，跨国安徽，湖北，湖南，贵州，云南几个省区，连绵数千公里。

从南京直奔瑞丽的时候，也是路过了保山，只是我们的出发点是瑞丽，后来因为中缅边界，原本计划要走的路线不让走了，只能绕到腾冲前往怒江。

同行一个摄影师的表哥在瑞丽那边做缉毒警察，也是很热情的接待了我们，然后带我们吃了最正宗的景颇族手抓饭，讲了自己亲身经历，也算是真实版的“边境风云”。

总之，在瑞丽的日子吃喝玩乐还是蛮到位的，应该说是一座“脏腑虽小，五脏俱全”的边陲小镇了。

从瑞丽一个不知道名字的县城出发到和顺的路上，一开始走的都是土路，是在陡峭的山壁上修建出来的，坐在车里，向外望去，身下的悬崖真的是深不见底，沟壑纵横之中，只听见滇西的狂风呼呼的吹，凄厉的回旋在耳畔。


车上有人开玩笑说，要是我们从这里掉下去，光滚下去都要滚好几分钟了，引得大家大笑了一场，担心害怕的氛围瞬间少了很多。

路上有一小段路程，透过车窗呼啸的风，好像依稀可以看见著名的怒江，从很远的地方游来，穿过一座又一座的大桥，又向远方游去，听说怒江的水最后是会流入到印度洋中，而这个时候，我想起了几个“印度洋的眼泪”字，也不知道为什么会这样。

腾冲的旅游，历来都是比较火的，也许应该归功于电影电视，那些大张旗鼓的宣传滇西抗日的场景。就像很多人没有去过腾冲都知道的一句广告词：“游万年火山热海，走千年古道边关”。

当然，也不完全是这样，最主要的还是因为现在的人们，生活都慢慢变好了，有空就想要出去走走。


到腾冲的时候，已经是傍晚时分了，然后不想留在县城里面，就继续赶往和顺。

不经意的看到和顺古镇的夕阳西下，便不由自主的“哇”了一声，我们都停下来，就坐在古镇的对面，面前有大片大片的水稻，虽然还没有成金黄色，可是相当的兴奋。

古镇依山而建，临水而居，错落有致，民居环山而建。从这里开始道理都是由青石板铺就而成，纵横交错，犹如小镇的血脉。一条小河绕过古镇，在这里迂徊成一个天然的湖塘，塘水清澈见底

安宁静谧的古镇仿若世外桃源一般。我们在田间游走，嬉戏玩耍，一次又一次的按下快门。再后来，随性坐下来，安静的看着它逐渐消失在视线里，然后又是古镇的华灯初上了。

本来就没有打算来这个地方，那一切际遇都按顺其自然的方式来吧，也许这样也会有很多的惊喜。

包括住宿，是我们在路边坐着吃西瓜的时候，一个阿姨问我们有住的地方吗？刚好也开始下起了小雨，我们异口同声地说还没有呢，她问我们去不去她那儿住，我们也答应了，就跟着她的小电驴后面到了客栈。


走进古镇，街道两旁店肆林立，各种灯光淡淡地普洒在红砖绿瓦上或者那眼色鲜艳的楼阁飞檐之上，给眼前这一片繁盛的古镇晚景增添了几分朦胧和诗意。

人还是蛮少的，一种宁静的气味铺面而来。也许是因为雨越来越大的缘故吧。

往客栈的路，一直是上坡，还绕了很多巷子才到，进去的那一瞬间感觉还蛮不错的，两层木质阁楼，加一个小院子，就是房间里面有点湿。

老板地地道道的当地人，招呼我们坐下，然后开始泡茶。听说我们要拍东西，然后给了我们很多建议，而且还说可以给我们做一道特色菜，材料我们自己去买。

在此之前，我虽然知道腾冲，也知道和顺古镇，但是我确实没有听说过土锅子这样一道菜。也许我是一个地地道道的吃货，每次一说到吃的东西都忍不住想去尝试。


第二天，和顺古镇的第一个黎明，大家肚还在熟睡，天刚蒙蒙亮，我一个人就拿着相机蹑手蹑脚的出去，也不知道往哪儿走，不知不觉到野鸭湖畔。此时，四周一片寂静，微风拂煦，野鸭湖微波粼粼，柳枝轻轻摇摆，哇，空气真好。

然后赶回去，和老板娘一起去买材料。这里的清晨很热闹，很多当地人在这里摆东西，一条长长的街道被人群占满，水泄不通。

我们快速买完返回客栈，老板娘不让我帮忙，然后自己和女儿开始在厨房里忙碌，两个小时后，期待已久的菜做好了，非常的特别。

腾冲土锅子是腾冲当地的火锅，是一道风味独特的菜肴。

有特点的是，腾冲火锅不使用金属火锅，只使用腾冲城郊满邑村烧制的土陶火锅，讲究慢火慢煮，因而菜味鲜甜醇和。

腾冲火锅过去多在春、秋二季到山野扫墓祭祖时食用，现已不受时间限制，成为日常宴客用餐。吃火锅时，十人八人围成一圈，或在山野，或在家中，欢声笑语，气氛热烈，感情融融，正像那蒸腾着热气的火锅一样。

有幸吃到客栈老板做的比较纯正的土锅子，也是回味无穷，或者说吃到了某一种细腻的家乡菜的感觉一样。


吃完饭，也不知道老板怎么了，就说要给我们当一天的免费导游。没想到，是有条件的交换，要求是我们拍的视频里要有他家的客栈，答应了，有点来者不拒的意思了。

然后就一整天都在古镇里晃悠，和顺古镇的魅力和精华，在我看来当数这里的古建筑和民居，或雕梁画栋，或青瓦灰墙，每一栋楼房都像一件精美绝伦的艺术品。这里的民居多为合院式建筑，一般由正房、厢房、厅房、照壁等基本元素构成。

途中也会路过各种祠堂，当然我还是比较喜欢那些依河而建的洗衣亭，感觉在演绎一种丰富多彩的“河文化”。

这里的赌石很出名，不过我没有参与，因为我来这里并不是为了什么赌石，或者万年火山之类的。

我什么也没有准备，就是很自然的到来。























如果非要问我为什么喜欢和顺，

我认真的我想了想，大概是因为同其他古镇相比，和顺好像是多了些大气，却又少了些商业气息，多了些文化古韵，自然少了些喧嚣热闹。

这里的美和静，不多不少，感觉一切都刚刚好。所以我来到这里，除了参观景点、观赏建筑，也可以用闲适、安然得生活态度，卸下压力，惬意的小住几日。

当然这只是我个人的我感觉，也许你去的时候就不是这样了，每个人在同一个环境下的经历，心情……都是不一样的，所以感受当然也不会相同。














这些年，我走过很多地方的桥，看过很多地方的云雨，去过许多地方的小镇，观赏过很多的老房子的安然，轻轻的踩踏过很多地方的青石板小巷，也被许多地方的美景迷醉过……

当第一次来到这个古镇的时候，梦似乎找到了栖息的地方，也就是想要在这里慢慢变老的欲望有感而生，不过我知道自己还是会走，离开继续自己等我旅途，可是走了又有什么关系呢，有些地方，来过便足矣。

希望有那么一个地方，总有那么一点阳光，一点点就好。

愿我们既往不恋，当下不杂，未来不迎，

愿你我一生心安宁，愿我们都各自安好。

图片发自简书App
我是有备而来的路人甲——大萌，一个对世界上瘾的二逼青年。如果我写过的任何一句话，拍过的每一张照片，做过的任何举动，曾在你的心里荡起涟漪，那至少说明在逝去的岁月里，我们在某一刻，共同经历着一样的情愫。

有时候，虽然素未谋面。

却已相识很久，很微妙也很知足。

如果你喜欢鄙文和图片，那就在下面点个喜欢呀，你的鼓励是我最大的动力来源，在此大萌深表感恩。

当然巧好你也喜欢我的话，我们可以互相关注，相互学习的哟！';

        $topics = \App\Models\Topic::pluck('id')->toArray();

        $users = \App\Models\User::pluck('id')->toArray();

        $data = [];

        $timestamp = \Carbon\Carbon::now();
        for ($i = 0; $i < 100; $i ++) {
            $data[] = [
                'title'    => array_random($titles),
                'content'  => $content,
                'user_id'  => 1,
                'topic_id' => array_random($topics),
                'created_at' => $timestamp,
            ];
        }

        DB::table('articles')->insert($data);
    }
}
